Core/src/InformationRegisters/УдержанияДляПенсионногоФонда/УдержанияДляПенсионногоФонда.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>УдержанияДляПенсионногоФонда</name>
  <informationRegisterPeriodicity>Month</informationRegisterPeriodicity>
  <resources>
    <name>ВидУдержания</name>
    <type>
      <types>CatalogRef.ВидыНачисленийИУдержаний</types>
    </type>
  </resources>
  <resources>
    <name>УчаствуетДобровольно</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>Актуальность</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <dimensions>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Договор</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Core/src/InformationRegisters/УдержанияДляПенсионногоФонда/Forms/ФормаЗаписи/Module.bsl
&НаКлиенте
Процедура КонтрагентПриИзменении(Элемент)
	Запись.Договор = РС_ОбщегоНазначения.ПолучитьЗначениеРеквизита(Запись.Контрагент, "ДоговорПоУмолчанию");
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если ЗначениеЗаполнено(Запись.Договор) И Не ЗначениеЗаполнено(Запись.Контрагент) Тогда
		Запись.Контрагент = Запись.Договор.Владелец;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Актуальность_ПриИзменении();
КонецПроцедуры

&НаКлиенте
Процедура АктуальностьПриИзменении(Элемент)
	Актуальность_ПриИзменении();
КонецПроцедуры

&НаКлиенте
Процедура Актуальность_ПриИзменении()
	Если Запись.Актуальность Тогда
		Элементы.ВидУдержания.ТолькоПросмотр						= Ложь;
	Иначе
		Запись.ВидУдержания				= Неопределено;
		
		Элементы.ВидУдержания.ТолькоПросмотр			= Истина;
	КонецЕсли;		
	
	Элементы.ВидУдержания.АвтоОтметкаНезаполненного				= Запись.Актуальность И НЕ ЗначениеЗаполнено(Запись.ВидУдержания);
	Элементы.ВидУдержания.ОтметкаНезаполненного					= Запись.Актуальность И НЕ ЗначениеЗаполнено(Запись.ВидУдержания);
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	Если Запись.Актуальность Тогда
		Если НЕ ЗначениеЗаполнено(Запись.ВидУдержания) Тогда
			Сообщить(НСтр("ka='არ არის შევსებული ველი ""დაკავების სახეობა""';ru='Не заполнена поле ""Вид удержания""';en='Do not fill in the ""View hold""'"));
			Отказ = Истина;
		КонецЕсли;
	КонецЕсли;
		
КонецПроцедуры
